## Koşullu Eleman İşlemleri

In [2]:
import numpy as np
import pandas as pd

m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns= ["var1","var2","var3"])
df

   var1  var2  var3
0    12    23     8
1    27     7    15
2     9    20    10
3    29    10     6
4    21    20     8
5     7     7    12
6     7     4    17
7     4     3     8
8    21    27    28
9    19    29     9

In [3]:
df["var1"]

0    12
1    27
2     9
3    29
4    21
5     7
6     7
7     4
8    21
9    19
Name: var1, dtype: int32

In [4]:
df["var1"][0:1]

0    12
Name: var1, dtype: int32

In [5]:
df[0:2]

   var1  var2  var3
0    12    23     8
1    27     7    15

In [7]:
df[0:2][["var1","var2"]]

   var1  var2
0    12    23
1    27     7

In [8]:
df

   var1  var2  var3
0    12    23     8
1    27     7    15
2     9    20    10
3    29    10     6
4    21    20     8
5     7     7    12
6     7     4    17
7     4     3     8
8    21    27    28
9    19    29     9

In [11]:
# var1 isimli değişkende 15 ten büyük değerleri filtreledik.
df[df.var1 > 15]

   var1  var2  var3
1    27     7    15
3    29    10     6
4    21    20     8
8    21    27    28
9    19    29     9

In [12]:
df[df.var1 > 15]["var2"]

1     7
3    10
4    20
8    27
9    29
Name: var2, dtype: int32

In [13]:
# birden fazla koşul

In [15]:
df[(df.var1 > 15) & (df.var3 < 10)]

   var1  var2  var3
3    29    10     6
4    21    20     8
9    19    29     9

In [16]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
1    27     7
3    29    10
4    21    20
8    21    27
9    19    29

In [17]:
## bir diğer yöntem. 
df[(df.var1 > 15)] [["var1","var2"]]

   var1  var2
1    27     7
3    29    10
4    21    20
8    21    27
9    19    29